randread/150_node/job_1471005_fiojob_2/nid00136_fiojob_2/output.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=256
...
fio-3.27
Starting 2 processes
rand-read: Laying out IO file (1 file / 1024MiB)

test: (groupid=0, jobs=2): err= 0: pid=149106: Tue Jul 20 11:10:51 2021
  read: IOPS=287, BW=1150KiB/s (1177kB/s)(337MiB/300023msec)
    slat (usec): min=449, max=70342, avg=6937.42, stdev=4599.19
    clat (usec): min=15, max=2114.9k, avg=1769064.77, stdev=112666.21
     lat (msec): min=7, max=2124, avg=1776.00, stdev=112.79
    clat percentiles (msec):
     |  1.00th=[ 1552],  5.00th=[ 1636], 10.00th=[ 1670], 20.00th=[ 1703],
     | 30.00th=[ 1737], 40.00th=[ 1754], 50.00th=[ 1770], 60.00th=[ 1787],
     | 70.00th=[ 1821], 80.00th=[ 1838], 90.00th=[ 1888], 95.00th=[ 1905],
     | 99.00th=[ 1972], 99.50th=[ 1989], 99.90th=[ 2039], 99.95th=[ 2072],
     | 99.99th=[ 2106]
   bw (  KiB/s): min=  520, max= 1464, per=99.94%, avg=1149.78, stdev=49.26, samples=1192
   iops        : min=  130, max=  366, avg=287.43, stdev=12.31, samples=1192
  lat (usec)   : 20=0.01%, 50=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.02%, 250=0.05%
  lat (msec)   : 500=0.08%, 750=0.09%, 1000=0.09%, 2000=99.25%, >=2000=0.42%
  cpu          : usr=0.33%, sys=2.19%, ctx=86256, majf=0, minf=589
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.9%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=86237,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=1150KiB/s (1177kB/s), 1150KiB/s-1150KiB/s (1177kB/s-1177kB/s), io=337MiB (353MB), run=300023-300023msec